made a plan for the issue #26
